"CIAdditionCompositing" = "Dodaje składniki koloru, aby osiągnąć efekt rozjaśnienia. Filtr ten jest zwykle używany do dodawania rozjaśnień i efektu flary obiektywu.";"CIAffineClamp" = "Wykonuje transformację afiniczną na obrazie źródłowym, po czym ogranicza piksele wokół przetransformowanego obrazu, rozciągając je na zewnątrz. Filtr ten działa podobnie jak CIAffineTransform, lecz wytwarza obraz rozciągający się w nieskończoność. Można użyć tego filtru do rozmazania obrazu przy jednoczesnym usunięciu miękkiej, czarnej ramki wokół krawędzi.";"CIAffineTile" = "Nanosi transformację afiniczną, po czym tworzy mozaikę.";"CIAffineTransform" = "Nanosi na obraz transformację afiniczną. Obraz wejściowy można przeliczać, skalować i obracać. Można także użyć kombinacji tych przekształceń.";"CIBarsSwipeTransition" = "Przechodzi z jednego obrazu do drugiego, odwracając prostokątne fragmenty obrazu tła i odsłaniając obraz wynikowy.";"CIBlendWithMask" = "Dokonuje interpolacji obrazu i tła przy użyciu maski szarości. Gdy wartość maski równa jest 0,0, wynikiem jest obraz tła. Gdy wartość maski równa jest 1,0, wynikiem jest obraz wejściowy.";"CIBloom" = "Zmiękcza krawędzie i dodaje lekką poświatę.";"CIBoxBlur" = "Wygładza lub wyostrza obraz, wykorzystując sześcienne jądro splotu.";"CIBumpDistortion" = "Tworzy podbicie wypukłe lub wklęsłe, rozpoczynające się w określonym punkcie obrazu.";"CIBumpDistortionLinear" = "Tworzy podbicie zaczynające się od liniowej części obrazu.";"CICMYKHalftone" = "Tworzy kolorową, półtonową interpretację obrazu źródłowego, nakładając cyjan, magentę, żółć i czerń na białe tło.";"CICheckerboardGenerator" = "Tworzy wzór szachownicy. Można określić jego wielkość, kolory i wyostrzenie. ";"CICircleSplashDistortion" = "Zniekształca piksele, zaczynając od obwodu koła i przesuwając się na zewnątrz.";"CICircularScreen" = "Symuluje okręgi półtonowe.";"CICircularWrap" = "Owija obraz wokół przezroczystego koła. Zniekształcenie obrazu zwiększa się wraz z odległością od środka koła.";"CIColorControls" = "Dostosowuje nasycenie, jasność i kontrast.";"CIColorCube" = "Używa trójwymiarowej tabeli kolorów do transformacji pikseli obrazu źródłowego. Tabela kolorów musi być złożona ze zmiennoprzecinkowych komórek RGBA, używających mnożonego przez macierz „z przodu” kanału alfa (tzw. „premultiplied alpha”). Komórki te są ułożone w standardowej kolejności. Kolumny i wiersze danych są indeksowane przez kolor czerwony i zielony. Po każdej płaszczyźnie następuje kolejna, wyższa płaszczyzna, indeksowana przez kolor niebieski.";"CIColorInvert" = "Odwraca kolory w obrazie.";"CIColorMap" = "Dokonuje nielinearnej transformacji źródłowych wartości koloru za pomocą wartości mapy dostępnych w tabeli.";"CIColorMatrix" = "Mnoży wartości kolorów źródłowych i dodaje współczynnik obciążenia do każdej z nich.";"CIColorMonochrome" = "Zmienia kolory tak, aby stanowiły one odcień pojedynczego koloru.";"CIColorPosterize" = "Odwzorowuje składniki koloru czerwonego, zielonego i niebieskiego przez ilość wartości jasności, określoną dla każdego z nich. Filtr ten spłaszcza kolory, umożliwiając osiągnięcie efektu podobnego do sitodruku.";"CIComicEffect" = "Symuluje rysunek komiksowy, obrysowując krawędzie i nanosząc efekt półtonowy.";"CIConstantColorGenerator" = "Generuje stały kolor. Wynik działania tego filtru używany jest zwykle jako źródło dla innych filtrów.";"CICopyMachineTransition" = "Przejście z jednego obrazu do drugiego poprzez symulację efektu działania kserokopiarki.";"CICrop" = "Kadruje (przycina) obraz. Wielkość i kształt przycięcia zależna jest od wskazanego prostokąta.";"CICrystallize" = "Tworzy kolorowe, wielokątne bloki, sumując wartości kolorów pikseli źródłowych.";"CIDiscBlur" = "Wygładza lub wyostrza obraz, wykorzystując owalne jądro splotu.";"CIDisintegrateWithMaskTransition" = "Przekształca jeden obraz w drugi, za pomocą kształtu zdefiniowanego przez maskę.";"CIDisplacementDistortion" = "Nanosi wartości szarości drugiego obrazu na pierwszy obraz. Obraz wynikowy ma teksturę określoną przez te wartości.";"CIDissolveTransition" = "Zamienia jeden obraz w drugi przy użyciu przenikania.";"CIDotScreen" = "Symuluje kropki półtonowe.";"CIEdges" = "Wyszukuje wszystkie krawędzie w obrazie i wyświetla je w określonym kolorze.";"CIEdgeWork" = "Tworzy stylizowaną czarno-białą interpretację obrazu, przypominającą kształt wycięty w drewnie.";"CIEightfoldReflectedTile" = "Tworzy mozaikę z obrazu źródłowego, używając ośmiostronnej symetrii zwierciadlanej.";"CIExposureAdjust" = "Zmienia ustawienia ekspozycji dla obrazu w podobny sposób, w jaki zmienia się ekspozycję w aparacie fotograficznym za pomocą F-Stop.";"CIFalseColor" = "Odwzorowuje luminancję rampy dwóch kolorów. Kolor fałszywy jest często używany do przetwarzania danych naukowych (np. astronomicznych), takich jak obrazy w ultrafiolecie czy zdjęcia rentgenowskie.";"CIFastBoxBlur" = "Wygładza lub wyostrza obraz, wykorzystując sześcienne jądro splotu.";"CIFastDiscBlur" = "Wygładza lub wyostrza obraz, wykorzystując owalne jądro splotu.";"CIFlashTransition" = "Przechodzi z jednego obrazu do drugiego poprzez rozbłysk. Rozbłysk pojawia się w określonym punkcie. Początkowo jest mały, następnie szybko się powiększa, pokrywając cały obraz kolorem rozbłysku. Gdy zanika, pojawia się drugi obraz.";"CIFourfoldReflectedTile" = "Tworzy mozaikę z obrazu źródłowego, używając czterostronnej symetrii zwierciadlanej.";"CIFourfoldRotatedTile" = "Tworzy mozaikę z obrazu źródłowego, obracając go o 90 stopni.";"CIFourfoldTranslatedTile" = "Tworzy mozaikę z obrazu źródłowego, nanosząc 4 operacje przetwarzania.";"CIGammaAdjust" = "Dostosowuje jasność tonów średnich. Filtr ten jest najczęściej używany do kompensacji nielinearnego odwzorowania monitora. Dostosowanie parametru gamma pozwala na zmianę przejścia między czernią a bielą.";"CIGaussianBlur" = "Rozprasza piksele źródłowe o wielkość wynikającą z rozkładu Gaussa.";"CIGaussianGradient" = "Tworzy gradient, przechodzący od jednego koloru do drugiego za pomocą rozkładu Gaussa.";"CIGlassDistortion" = "Zniekształca obraz, nanosząc na niego teksturę szkła. Wzniesione obszary obrazu wynikowego są rezultatem nałożenia mapy tekstury.";"CIGlassLozenge" = "Tworzy soczewkę o kształcie rombu i zniekształca przykrytą nią część obrazu.";"CIGlideReflectedTile" = "Tworzy mozaikę z obrazu źródłowego, przetwarzając go i rozmazując.";"CIGloom" = "Zmniejsza rozjaśnienia obrazu.";"CIHatchedScreen" = "Symuluje zakreskowanie półtonowe.";"CIHeightFieldFromMask" = "Tworzy ciągłe, trójwymiarowe pole podniesienia na podstawie maski w skali szarości. Białe miejsca maski wskazują podnoszone piksele, czarne natomiast oznaczają piksele poza podniesieniem. Pole podniesienia zmienia się płynnie wewnątrz maski, osiągając wartość 0 na jej krawędzi. Można użyć tego filtru wraz z filtrem CIShadedMaterial, aby uzyskać wyjątkowo realistyczne, cieniowane obiekty.";"CIHexagonalPixellate" = "Wyświetla obraz w postaci sześcioboków o kolorach pochodzących z uśrednienia barw zastępowanych przez nie pikseli.";"CIHoleDistortion" = "Tworzy okrągłą powierzchnię, która wypycha piksele obrazu na zewnątrz, zniekształcając je tym bardziej, im bliżej znajdują się jej centrum.";"CIHueAdjust" = "Zmienia barwę (odcień) pikseli źródłowych.";"CIKaleidoscope" = "Tworzy kalejdoskopowy obraz z obrazu źródłowego, przy użyciu dwunastostronnej symetrii.";"CILanczosScaleTransform" = "Tworzy wysokiej jakości przeskalowaną wersję obrazu. Filtr ten jest zwykle używany do zmniejszania obrazów.";"CILenticularHaloGenerator" = "Symuluje poświatę, tworzoną poprzez dyfrakcję związaną z rozszerzeniem obiektywu. Filtr ten jest zwykle nanoszony na inny obraz, aby zasymulować np. flarę obiektywu.";"CILineOverlay" = "Tworzy szkic obrysowujący krawędzie obrazu na czarno i pozostawiający nie obrysowane części obrazu przezroczystymi. Wynik posiada kanał alfa i jest renderowany w czerni, więc aby go zobaczyć trzeba umieścić go ponad innym obrazem, korzystając z opcji Źródło ponad.";"CILineScreen" = "Symuluje wzór linii półtonowych.";"CILinearGradient" = "Tworzy gradient pomiędzy dwoma określonymi punktami na osi liniowej.";"CIMaskToAlpha" = "Zamienia obraz w skali szarości na biały kolor maskowany przez kanał alfa. Białe pola z obrazu źródłowego tworzą wnętrze maski, a czerń staje się przezroczysta.";"CIMaximumCompositing" = "Oblicza maksymalną wartość składników koloru dwóch obrazów wejściowych i tworzy obraz wyjściowy z użyciem maksymalnych wartości. Jest to podobne do rozjaśniania.";"CIMedianFilter" = "Oblicza wartość środkową (medianę) z grupy sąsiadujących pikseli i zamienia kolor każdego z nich na ten obliczony. Efekt ten służy do usuwania szumu.";"CIMinimumCompositing" = "Oblicza minimalną wartość składników koloru dwóch obrazów wejściowych i tworzy obraz wyjściowy z użyciem maksymalnych wartości. Jest to podobne do ściemniania.";"CIModTransition" = "Przechodzi od jednego obrazu do drugiego, pokazując obraz docelowy przez otwory o nieregularnym kształcie.";"CIMotionBlur" = "Rozmywa obraz, symulując efekt poruszenia aparatu o określony kąt i odległość.";"CIMultiplyCompositing" = "Mnoży wartości koloru obu obrazów wejściowych i tworzy obraz wynikowy z tych wartości. Filtr ten jest zwykle używany do dodawania światła reflektora lub podobnych efektów świetlnych.";"CINoiseReduction" = "Redukuje szum używając wartości progu, określającej co uznawane jest za szum. Małe zmiany luminancji poniżej tej wartości uznawane są za szum i są redukowane przy użyciu lokalnego rozmycia. Zmiany większe niż podany próg uznawane są za krawędzie, zostają więc wyostrzone.";"CIOpTile" = "Dzieli obraz na segmenty, wykonuje określone skalowanie i obrót, po czym składa obraz ponownie, tworząc wygląd op-art.";"CIPageCurlTransition" = "Przechodzi z jednego obrazu do drugiego, symulując odwracanie strony i ukazując obraz docelowy pod spodem.";"CIParallelogramTile" = "Odkształca obraz, odbijając go w wieloboku, po czym tworzy mozaikę z obrazem wynikowym.";"CIPerspectiveTile" = "Nanosi transformację perspektywiczną, po czym tworzy mozaikę z obrazem wynikowym.";"CIPerspectiveTransform" = "Dostosowuje geometrię obrazu, symulując zmianę położenia obserwatora. Można użyć filtru perspektywy, aby pochylić obraz.";"CIPinchDistortion" = "Tworzy prostokątną powierzchnię, ściskającą piksele źródłowe. Im bliżej jej leżą piksele, tym bardziej zostają zdeformowane. ";"CIPixellate" = "Przedstawia obraz jako duże, kwadratowe piksele.";"CIPointillize" = "Punktylizuje obraz źródłowy.";"CIRadialGradient" = "Tworzy gradient kołowy pomiędzy dwoma okręgami, mającymi ten sam środek. Jeden z okręgów może mieć promień równy 0.";"CIRandomGenerator" = "Tworzy obraz o nieograniczonych rozmiarach, w którym wartości pikseli pochodzą z generatora liczb losowych (od 0 do 1).";"CIRippleTransition" = "Przechodzi z jednego obrazu do drugiego poprzez efekt kropli spadającej do wody. Powstaje wówczas fala, oddalająca się od punktu centralnego i odsłaniająca obraz docelowy.";"CISepiaTone" = "Zamienia kolory obrazu na rozmaite odcienie brązu.";"CIShadedMaterial" = "Tworzy cieniowany obraz z pola wysokości. Pole wysokości określane jest przez jaśniejsze stopnie szarości (wyższe wzniesienie) i ciemniejsze (niższe fragmenty). Można połączyć ten filtr z filtrem CIHeightFieldFromMask, aby utworzyć szybkie cieniowanie takich masek, jak np. tekst.";"CISharpenLuminance" = "Wydobywa detale obrazu poprzez jego wyostrzenie. Zmienia tylko luminancję obrazu. Chrominancja pozostaje niezmieniona.";"CISixfoldReflectedTile" = "Tworzy mozaikę z obrazu źródłowego, używając sześciostronnej symetrii zwierciadlanej.";"CISixfoldRotatedTile" = "Tworzy mozaikę z obrazu źródłowego, obracając go o 60 stopni.";"CISourceAtopCompositing" = "Umieszcza obraz źródłowy ponad obrazem tła, po czym używa luminancji obrazu tła, aby określić fragmenty, które mają zostać wyświetlone. W efekcie pojawia się obraz tła i tylko te fragmenty obrazu źródłowego, które znajdują się ponad widocznym częściami tła.";"CISourceInCompositing" = "Używa drugiego obrazu do określenia, co pozostawić w obrazie źródłowym, powodując kadrowanie (obcięcie) obrazu.";"CISourceOutCompositing" = "Używa drugiego obrazu, aby określić, co usunąć z pierwszego obrazu.";"CISourceOverCompositing" = "Umieszcza drugi obraz nad pierwszym.";"CISpotColor" = "Zamienia jeden lub kilka zakresów kolorów na inne kolory.";"CISpotLight" = "Nanosi efekt światła reflektora punktowego.";"CIStarShineGenerator" = "Tworzy wzór gwiazd. Zwykle wykorzystywany jako źródło dla innego filtru";"CIStripesGenerator" = "Tworzy wzór składający się z pasków. Można zmienić ich kolor, odstęp i kontrast.";"CISunbeamsGenerator" = "Tworzy efekt słońca. Zwykle wykorzystywany jako źródło dla innego filtru.";"CISwipeTransition" = "Przechodzi z jednego obrazu do drugiego, symulując odwrócenie.";"CITorusLensDistortion" = "Tworzy soczewkę o kształcie torusa (pierścienia) i zniekształca przykrytą nią część obrazu.";"CITriangleTile" = "Odwzorowuje trójkątną część obrazu na trójkątnym obszarze, po czym tworzy mozaikę z obrazu wynikowego.";"CITwelvefoldReflectedTile" = "Tworzy mozaikę z obrazu źródłowego, używając dwunastostronnej symetrii zwierciadlanej.";"CITwirlDistortion" = "Obraca piksele wokół jednego punktu, tworząc płaskie zniekształcenie. Można określić ilość obrotów, wskazać punkt centralny i kąt.";"CIUnsharpMask" = "Zwiększa kontrast krawędzi między pikselami o różnych kolorach.";"CIVortexDistortion" = "Obraca piksele wokół jednego punktu, tworząc wir. Można określić ilość obrotów, wskazać punkt centralny i kąt.";"CIWhitePointAdjust" = "Dostosowuje punkt bieli obrazu i odwzorowuje w niego wszystkie kolory w obrazie źródłowym.";"CIZoomBlur" = "Symuluje efekt zoom w aparacie podczas robienia zdjęcia.";"CIColorBlendMode" = "Używa wartości luminancji tła wraz z barwą i nasyceniem obrazu źródłowego. Ten tryb zachowuje poziomy szarości obrazu.";"CIColorBurnBlendMode" = "Przyciemnia próbki obrazu tła, aby odzwierciedlały próbki obrazu źródłowego. Biel nie powoduje żadnej zmiany.";"CIColorDodgeBlendMode" = "Rozjaśnia próbki obrazu tła, aby odzwierciedlały próbki obrazu źródłowego. Czerń nie powoduje żadnej zmiany.";"CIDarkenBlendMode" = "Tworzy złożone próbki obrazu, wybierając ciemniejsze próbki zarówno z obrazu źródłowego, jak i z tła. W rezultacie próbki tła są zamieniane na próbki obrazu źródłowego, gdy te drugie są ciemniejsze. Jeśli nie, pozostają one bez zmian.";"CIDifferenceBlendMode" = "Odejmuje próbkę koloru obrazu źródłowego od próbki koloru tła, lub odwrotnie, w zależności od tego, która z nich ma większą wartość jasności. Czarne fragmenty obrazu źródłowego nie powodują żadnej zmiany; białe odwracają wartości koloru tła.";"CIExclusionBlendMode" = "Tworzy efekt podobny do filtru CIDifferenceBlendMode, ale o niższym kontraście. Czarne miejsca obrazu źródłowego nie powodują żadnej zmiany; białe odwracają wartości koloru tła.";"CIHardLightBlendMode" = "Jeżeli kolor próbki obrazu źródłowego jest jaśniejszy niż 50% szarości, tło zostaje rozjaśnione. Jeśli kolor próbki obrazu źródłowego jest ciemniejszy niż 50% szarości, tło zostaje przyciemnione. Gdy kolor próbki obrazu źródłowego jest równy 50% szarości, obraz nie zostaje zmieniony. Próbki całkowicie czarne lub całkowicie białe pozostają w swoim kolorze. Efekt całościowy podobny jest do rozświetlenia obrazu silnym światłem.";"CIHueBlendMode" = "Używa wartości luminancji i nasycenia tła z wartościami barwy obrazu źródłowego.";"CILightenBlendMode" = "Tworzy złożone próbki obrazu, wybierając jaśniejsze próbki zarówno z obrazu źródłowego, jak i z tła. W rezultacie próbki tła są zamieniane na próbki obrazu źródłowego, gdy te drugie są jaśniejsze. Jeśli nie, pozostają one bez zmian.";"CILuminosityBlendMode" = "Używa barwy i nasycenia obrazu tła z luminancją obrazu źródłowego. Filtr ten działa odwrotnie do filtru CIColorBlendMode.";"CIMultiplyBlendMode" = "Mnoży wartości próbek koloru obrazu źródłowego z wartościami próbek koloru tła. W wyniku otrzymujemy kolory które są co najmniej tak ciemne, jak na jednym lub drugim obrazie składowym.";"CIOverlayBlendMode" = "Nanosi próbki koloru obrazu źródłowego na obraz tła, zachowując jasności i cienie tego ostatniego. Kolor tła mieszany jest z obrazem źródłowym, aby odzwierciedlić jasne i ciemne punkty tła.";"CISaturationBlendMode" = "Używa wartości luminancji i barwy obrazu tła z nasyceniem obrazu źródłowego. Obszary tła, które nie mają nasycenia (czyli obszary wypełnione szarością) nie powodują żadnej zmiany.";"CIScreenBlendMode" = "Mnoży odwrotność próbek obrazu źródłowego z odwrotnością próbek obrazu tła. W rezultacie otrzymujemy kolory które są przynajmniej tak jasne, jak dowolny z dwóch kolorów składowych.";"CISoftLightBlendMode" = "Przyciemnia lub rozjaśnia kolory, w zależności od koloru próbki obrazu źródłowego. Jeżeli kolor próbki obrazu źródłowego jest jaśniejszy niż 50% szarości, tło zostaje rozjaśnione. Jeśli kolor próbki obrazu źródłowego jest ciemniejszy niż 50% szarości, tło zostaje przyciemnione. Gdy kolor próbki obrazu źródłowego jest równy 50% szarości, obraz nie zostaje zmieniony. Próbki całkowicie czarne lub całkowicie białe zamieniane są na jaśniejsze lub ciemniejsze, ale nigdy nie pozostają czarne lub białe. Efekt całościowy podobny jest do rozświetlenia obrazu rozproszonym światłem.";"outputImage" = "Obraz wytworzony przez filtr.";"inputBackgroundImage" = "Obraz do użycia w tle.";"inputImage" = "Obraz używany jako obraz wejściowy. Dla filtrów korzystających z obrazu tła, to jest obraz na pierwszym planie.";"inputTime" = "Czas trwania efektu.";"inputTransform" = "Transformacja do naniesienia.";"inputScale" = "Siła efektu.";"inputAspectRatio" = "Stosunek szerokości do wysokości.";"inputCenter" = "Środek obszaru filtru (współrzędne x i y).";"inputRadius" = "Odległość od centrum efektu.";"inputAngle" = "Kąt.";"inputRefraction" = "Stopień załamania przez materiał (np. szkło), wykorzystywanego przy tworzeniu efektu.";"inputWidth" = "Szerokość efektu.";"inputSharpness" = "Ilość wyostrzenia.";"inputIntensity" = "Intensywność efektu.";"inputEV" = "Ilość pozycji F-Stop rozjaśniających lub przyciemniających obraz.";"inputSaturation" = "Stopień zmiany nasycenia.";"inputColor" = "Kolor.";"inputBrightness" = "Poziom jasności.";"inputContrast" = "Poziom kontrastu.";"inputGradientImage" = "Mapa alfa. Zwykle jest to obraz zawierający rozjaśnienia i cienie.";"inputMaskImage" = "Obraz maskujący.";"inputShadingImage" = "Mapa wartości alfa. Zwykle jest to obraz zawierający rozjaśnienia i cienie.";"inputTargetImage" = "Obraz docelowy dla przejścia.";"inputExtent" = "Prostokąt określający zasięg efektu.";"CIBoxBlur.inputRadius" = "Promień określa ilość pikseli użytych do stworzenia rozmycia. Im większy promień, tym bardziej rozmyty obraz.";"CIDiscBlur.inputRadius" = "Promień określa ilość pikseli użytych do stworzenia rozmycia. Im większy promień, tym bardziej rozmyty obraz.";"CIGaussianBlur.inputRadius" = "Promień określa ilość pikseli użytych do stworzenia rozmycia. Im większy promień, tym bardziej rozmyty obraz.";"CIMotionBlur.inputRadius" ="Promień określa ilość pikseli użytych do stworzenia rozmycia. Im większy promień, tym bardziej rozmyty obraz.";"CIMotionBlur.inputAngle" = "Kąt ruchu określa kierunek rozmycia.";"CINoiseReduction.inputNoiseLevel" = "Poziom redukcji szumu. Im większa wartość, tym większa redukcja szumu.";"CINoiseReduction.inputSharpness" = "Ostrość obrazu wynikowego. Im większa wartość, tym ostrzejszy obraz.";"CIZoomBlur.inputCenter" = "Współrzędne x i y środka efektu.";"CIZoomBlur.inputAmount" = "Stopień powiększenia. Im większa wartość, tym większe powiększenie.";"CIColorControls.inputSaturation" = "Intensywność nasycenia. Im większa wartość, tym bardziej nasycone kolory w obrazie wynikowym.";"CIColorControls.inputBrightness" = "Intensywność rozjaśnienia. Im większa wartość, tym jaśniejszy obraz wynikowy.";"CIColorControls.inputContrast" = "Intensywność kontrastu. Im większa wartość, tym bardziej kontrastowy obraz wynikowy.";"CIColorMatrix.inputRVector" = "Ilość koloru czerwonego, używana jako mnożnik dla źródłowych wartości kolorów.";"CIColorMatrix.inputGVector" = "Ilość koloru zielonego, używana jako mnożnik dla źródłowych wartości kolorów.";"CIColorMatrix.inputBVector" = "Ilość koloru niebieskiego, używana jako mnożnik dla źródłowych wartości kolorów.";"CIColorMatrix.inputAVector" = "Kanał alfa, używany jako mnożnik dla źródłowych wartości kolorów.";"CIColorMatrix.inputBiasVector" = "Wektor dodawany do każdego składnika koloru.";"CIExposureAdjust.inputEV" = "Stopień zmiany ekspozycji. Im większa wartość, tym jaśniejszy obraz.";"CIGammaAdjust.inputPower" = "Wartość gamma używana do korekcji jasności. Im większa wartość, tym ciemniejszy obraz.";"CIHueAdjust.inputAngle" = "Kąt (w stopniach) używany do korekcji barwy obrazu.";"CIWhitePointAdjust.inputColor" = "Kolor używany jako punkt bieli.";"CIColorCube.inputDimension" = "Wymiar tabeli kolorów.";"CIColorCube.inputCubeData" = "To jest tabela kolorów złożona ze zmiennoprzecinkowych komórek RGBA, używających mnożonego przez macierz „z przodu” kanału alfa (tzw. „premultiplied alpha”). Kolumny i wiersze danych są indeksowane przez kolor czerwony i zielony. Za każdą płaszczyzną danych znajduje się kolejna, wyższa płaszczyzna, indeksowana przez kolor niebieski.";"CIColorMap.inputGradientImage" = "Dane tego obrazu przekształcają wartości z obrazu źródłowego.";"CIColorMonochrome.inputColor" = "Monochromatyczny kolor do naniesienia na obraz.";"CIColorMonochrome.inputIntensity" = "Intensywność efektu monochromatycznego. Wartość równa 1,0 tworzy monochromatyczny obraz z użyciem wybranego koloru. Wartość równa 0,0 nie ma wpływu na obraz.";"CIColorPosterize.inputLevels" = "Poziomy jasności dla każdego składnika koloru. Im niższe wartości, tym bardziej widoczny efekt.";"CIFalseColor.inputColor0" = "Pierwszy kolor do użycia w progu kolorów.";"CIFalseColor.inputColor1" = "Drugi kolor do użycia w progu kolorów.";"CISepiaTone.inputIntensity" = "Intensywność efektu sepii. Wartość równa 1,0 tworzy monochromatyczny obraz w odcieniach brązu. Wartość równa 0,0 nie ma wpływu na obraz.";"CIBumpDistortion.inputCenter" = "Współrzędne x i y środka podbicia."; "CIBumpDistortion.inputRadius" = "Promień określa ilość pikseli użytych do wytworzenia zniekształcenia. Im większy promień, tym większy zasięg zniekształcenia."; "CIBumpDistortion.inputScale" = "Skala efektu określająca krzywiznę podbicia. Wartość równa 0,0 nie ma wpływu. Wartości dodatnie powodują podbicie w górę. Wartości ujemne powodują podbicie w dół."; "CIBumpDistortionLinear.inputCenter" = "Współrzędne x i y środka zniekształcenia."; "CIBumpDistortionLinear.inputRadius" = "Promień określa ilość pikseli użytych do wytworzenia zniekształcenia. Im większy promień, tym większy zasięg zniekształcenia.";  "CIBumpDistortionLinear.inputScale" = "Skala efektu."; "CIBumpDistortionLinear.inputAngle" = "Kąt linii (w stopniach), wokół której pojawia się zniekształcenie."; "CICircleSplashDistortion.inputCenter" = "Współrzędne x i y środka zniekształcenia.";  "CICircleSplashDistortion.inputRadius" = "Promień określa ilość pikseli użytych do wytworzenia zniekształcenia. Im większy promień, tym większy zasięg zniekształcenia.";  "CICircularWrap.inputCenter" = "Współrzędne x i y środka zniekształcenia.";  "CICircularWrap.inputRadius" = "Promień określa ilość pikseli użytych do wytworzenia zniekształcenia. Im większy promień, tym większy zasięg zniekształcenia.";  "CICircularWrap.inputAngle" = "Kąt efektu."; "CIDisplacementDistortion.inputDisplacementImage" = "Obraz, którego wartości szarości zostaną naniesione na obraz źródłowy."; "CIDisplacementDistortion.inputScale" = "Siła tekstury na obrazie wynikowym. Im wyższa wartość, tym bardziej widoczna tekstura."; "CIGlassDistortion.inputTexture" = "Tekstura do naniesienia na obraz źródłowy.";"CIGlassDistortion.inputCenter" = "Współrzędne x i y środka zniekształcenia."; "CIGlassDistortion.inputScale" = "Siła tekstury na obrazie wynikowym. Im wyższa wartość, tym bardziej widoczna tekstura."; "CIGlassLozenge.inputPoint0" = "Współrzędne x i y środka okręgu na jednym z rogów rombu."; "CIGlassLozenge.inputPoint1" = "Współrzędne x i y środka okręgu na drugim z rogów rombu.";  "CIGlassLozenge.inputRadius" = "Promień rombu. Im większy promień, tym większy zasięg zniekształcenia.";  "CIGlassLozenge.inputRefraction" = "Załamanie światła w szkle."; "CIHoleDistortion.inputCenter" = "Współrzędne x i y środka zniekształcenia.";  "CIHoleDistortion.inputRadius" = "Promień określa ilość pikseli użytych do wytworzenia zniekształcenia. Im większy promień, tym większy zasięg zniekształcenia.";  "CIPinchDistortion.inputCenter" = "Współrzędne x i y środka zniekształcenia."; "CIPinchDistortion.inputRadius" = "Promień określa ilość pikseli użytych do wytworzenia zniekształcenia. Im większy promień, tym większy zasięg zniekształcenia."; "CIPinchDistortion.inputScale" = "Stopień ściśnięcia. Wartość równa 0,0 oznacza brak efektu. Wartość równa 1,0 to maksymalne ściśnięcie.";"CITorusLensDistortion.inputCenter" = "Współrzędne x i y środka pierścienia.";  "CITorusLensDistortion.inputRadius" = "Zewnętrzny promień pierścienia.";  "CITorusLensDistortion.inputWidth" = "Szerokość pierścienia."; "CITorusLensDistortion.inputRefraction" = "Załamanie światła w szkle."; "CITwirlDistortion.inputCenter" = "Współrzędne x i y środka zniekształcenia.";  "CITwirlDistortion.inputRadius" = "Promień określa ilość pikseli użytych do wytworzenia zniekształcenia. Im większy promień, tym większy zasięg zniekształcenia."; "CITwirlDistortion.inputAngle" = "Kąt obrotu (w stopniach). Wartości mogą być dodatnie lub ujemne.";"CIVortexDistortion.inputCenter" = "Współrzędne x i y środka zniekształcenia."; "CIVortexDistortion.inputRadius" = "Promień określa ilość pikseli użytych do wytworzenia zniekształcenia. Im większy promień, tym większy zasięg zniekształcenia."; "CIVortexDistortion.inputAngle" = "Kąt wiru (w stopniach).";"CICheckerboardGenerator.inputColor0" = "Kolor dla pierwszego zestawu pól szachownicy.";"CICheckerboardGenerator.inputColor1" = "Kolor dla drugiego zestawu pól szachownicy.";"CICheckerboardGenerator.inputWidth" = "Szerokość kwadratu we wzorze szachownicy.";"CICheckerboardGenerator.inputSharpness" = "Ostrość wzoru szachownicy. Im mniejsza wartość, tym bardziej rozmyty wzór. Przedział od 0,0 do 1,0.";"CIConstantColorGenerator.inputColor" = "Kolor do wygenerowania."; "CILenticularHaloGenerator.inputCenter" = "Współrzędne x i y środka poświaty.";"CILenticularHaloGenerator.inputHaloRadius" = "Promień poświaty.";"CILenticularHaloGenerator.inputHaloWidth" = "Szerokość poświaty, od promienia wewnętrznego do zewnętrznego.";"CILenticularHaloGenerator.inputOverlap" = "Stopień nakładania dyfrakcji składników poświaty. Wartość równa 1,0 oznacza całkowite nałożenie; poświata jest biała. Wartość równa 0,0 oznacza brak nałożenia; kolory poświaty nie nakładają się na obraz.";"CILenticularHaloGenerator.inputStriationStrength" = "Intensywność kolorów poświaty. Im większa wartość, tym większa intensywność.";"CILenticularHaloGenerator.inputStriationContrast" = "Kontrast kolorów poświaty. Im większa wartość, tym większy kontrast.";"CIStarShineGenerator.inputCenter" = "Współrzędne x i y środka gwiazdy."; "CIStarShineGenerator.inputColor" = "Kolor dla zewnętrznej części gwiazdy."; "CIStarShineGenerator.inputRadius" = "Promień gwiazdy."; "CIStarShineGenerator.inputCrossScale" = "Wielkość wzoru krzyżowego."; "CIStarShineGenerator.inputCrossAngle" = "Kąt wzoru krzyżowego."; "CIStarShineGenerator.inputCrossOpacity" = "Krycie wzoru krzyżowego."; "CIStarShineGenerator.inputCrossWidth" = "Szerokość wzoru krzyżowego."; "CIStarShineGenerator.inputEpsilon" = "Długość ramion krzyża."; "CIStripesGenerator.inputCenter" = "Współrzędne x i y środka wzoru pasków."; "CIStripesGenerator.inputColor0" = "Kolor dla parzystych pasków."; "CIStripesGenerator.inputColor1" = "Kolor dla nieparzystych pasków.";"CIStripesGenerator.inputWidth" = "Szerokość paska."; "CIStripesGenerator.inputSharpness" = "Ostrość wzoru pasków. Im mniejsza wartość, tym bardziej rozmyty wzór. Przedział od 0,0 do 1,0."; "CISunbeamsGenerator.inputCenter" = "Współrzędne x i y środka wzoru promieni słonecznych";"CISunbeamsGenerator.inputColor" = "Kolor słońca.";"CISunbeamsGenerator.inputSunRadius" = "Promień słońca.";"CISunbeamsGenerator.inputMaxStriationRadius" = "Promień światła słonecznego.";"CISunbeamsGenerator.inputStriationStrength" = "Intensywność promieni słonecznych. Im wyższa wartość, tym większa intensywność.";"CISunbeamsGenerator.inputStriationContrast" = "Kontrast promieni słonecznych. Im wyższa wartość, tym większy kontrast.";"CIAffineTransform.inputTransform" = "Transformacja do naniesienia na obraz."; "CICrop.inputRectangle" = "Prostokąt określający kadrowanie (przycięcie) obrazu."; "CILanczosScaleTransform.inputScale" = "Skalowanie obrazu. Wartość mniejsza niż 1,0 zmniejsza obraz. Wartość większa niż 1,0 powiększa obraz."; "CILanczosScaleTransform.inputAspectRatio" = "Stosunek wysokości obrazu do jego szerokości."; "CIPerspectiveTransform.inputTopLeft" = "Współrzędne lewego górnego rogu obrazu."; "CIPerspectiveTransform.inputTopRight" = "Współrzędne prawego górnego rogu obrazu."; "CIPerspectiveTransform.inputBottomRight" = "Współrzędne prawego dolnego rogu obrazu."; "CIPerspectiveTransform.inputBottomLeft" = "Współrzędne lewego dolnego rogu obrazu."; "CIGaussianGradient.inputColor0" = "Pierwszy kolor do gradientu."; "CIGaussianGradient.inputColor1" = "Drugi kolor do gradientu."; "CIGaussianGradient.inputRadius" = "Promień rozkładu Gaussa."; "CILinearGradient.inputPoint0" = "Początek gradientu - miejsce, gdzie zaczyna się pierwszy kolor."; "CILinearGradient.inputPoint1" = "Koniec gradientu - miejsce, gdzie pojawia się kolor wynikowy."; "CILinearGradient.inputColor0" = "Pierwszy kolor do gradientu.";  "CILinearGradient.inputColor1" = "Drugi kolor do gradientu.";  "CIRadialGradient.inputRadius0" = "Promień początkowego koła gradientu.";"CIRadialGradient.inputRadius1" = "Promień końcowego okręgu gradientu.";"CIRadialGradient.inputColor0" = "Pierwszy kolor do gradientu.";  "CIRadialGradient.inputColor1" = "Drugi kolor do gradientu."; "CICircularScreen.inputCenter" = "Współrzędne x i y środka okrągłego wzoru"; "CICircularScreen.inputWidth" = "Odległość między okręgami we wzorze."; "CICircularScreen.inputSharpness" = "Ostrość wzoru okręgów. Im większa wartość, tym ostrzejsze okręgi."; "CICMYKHalftone.inputCenter" = "Współrzędne x i y środka wzoru półtonowego.";  "CICMYKHalftone.inputWidth" = "Odległość między kropkami we wzorze."; "CICMYKHalftone.inputAngle" = "Kąt wzoru."; "CICMYKHalftone.inputSharpness" = "Ostrość wzoru. Im większa wartość, tym ostrzejszy wzór."; "CICMYKHalftone.inputGCR" = "Wartość zamienna składnika szarości. Wartość ta może zawierać się od 0,0 (brak) do 1,0."; "CICMYKHalftone.inputUCR" = "Wartość usuwania podkoloru. Wartość może zawierać się od 0,0 do 1,0."; "CIDotScreen.inputCenter" = "Współrzędne x i y środka wzoru kropek";  "CIDotScreen.inputAngle" = "Kąt wzoru."; "CIDotScreen.inputWidth" = "Odległość między kropkami we wzorze."; "CIDotScreen.inputSharpness" = "Ostrość wzoru. Im większa wartość, tym ostrzejszy wzór."; "CIHatchedScreen.inputCenter" = "Współrzędne x i y środka wzoru linii"; "CIHatchedScreen.inputAngle" = "Kąt wzoru.";"CIHatchedScreen.inputWidth" = "Odległość między liniami we wzorze."; "CIHatchedScreen.inputShaprness" = "Ostrość wzoru. Im większa wartość, tym ostrzejszy wzór."; "CILineScreen.inputCenter" = "Współrzędne x i y środka wzoru linii";  "CILineScreen.inputAngle" = "Kąt wzoru."; "CILineScreen.inputWidth" = "Odległość między liniami we wzorze."; "CILineScreen.inputSharpness" = "Ostrość wzoru. Im większa wartość, tym ostrzejszy wzór."; 	"CISharpenLuminance.inputSharpness" = "Siła wyostrzenia. Im wyższa wartość, tym większe wyostrzenie.";"CIUnsharpMask.inputRadius" = "Promień wokoło określonego piksela, w którym naniesiona zostanie maska wyostrzająca. Im większy promień, tym większy obszar obrazu zostanie zmieniony.";"CIUnsharpMask.inputIntensity" = "Intensywność efektu. Im większa wartość, tym większy kontrast w obszarze działania efektu.";"CIBlendWithMask.inputMaskImage" = "Maska szarości. Gdy wartość maski równa jest 0,0 otrzymujemy w wyniku samo tło. Gdy wartość maski równa jest 1,0, rezultatem jest obraz wejściowy."; "CIBloom.inputRadius" = "Promień określa ilość pikseli użytych do stworzenia efektu. Im większy promień, tym bardziej widoczny efekt.";"CIBloom.inputIntensity" = "Intensywność efektu. Wartość równa 0,0 oznacza brak efektu. Wartość równa 1,0 oznacza maksymalne użycie efektu."; "CICrystallize.inputRadius" = "Promień określa ilość pikseli użytych do stworzenia efektu. Im większy promień, tym większe kryształy."; "CIEdges.inputIntensity" = "Intensywność krawędzi. Im większa wartość, tym większa intensywność."; "CIEdgeWork.inputRadius" = "Grubość obramowania. Im większa wartość, tym grubsze obramowanie."; "CIGloom.inputRadius" = "Promień określa ilość pikseli użytych do stworzenia efektu. Im większy promień, tym bardziej widoczny efekt."; "CIGloom.inputIntensity" = "Intensywność efektu. Wartość równa 0,0 oznacza brak efektu. Wartość równa 1,0 oznacza maksymalne użycie efektu."; "CIHeightFieldFromMask.inputImage" = "Białe części maski określają piksele znajdujące się wewnątrz pola podniesienia, natomiast czarne określają piksele poza nim. Pole wewnątrz maski zmienia się łagodnie, osiągając wartość równą 0 na jej końcach."; "CIHeightFieldFromMask.inputRadius" = "Odległość od krawędzi maski (w przypadku łagodnego przejścia) jest proporcjonalna do promienia wejściowego. Większe wartości powodują gładsze przejście, mniejsze - bardziej przybliżone."; "CIHexagonalPixellate.inputCenter" = "Współrzędne x i y środka efektu"; "CIHexagonalPixellate.inputScale" = "Skala określa wielkość sześcioboków. Im większa wartość, tym większe sześcioboki."; "CILineOverlay.inputNRNoiseLevel" = "Poziom szumu, usuwanego przed wyszukiwaniem krawędzi obrazu. Zwiększenie poziomu szumu poprawia wykryte krawędzie."; "CILineOverlay.inputNRSharpness" = "Poziom wyostrzenia przy usuwaniu szumu, przed wyszukiwaniem krawędzi. Polepsza ich wykrywanie."; "CILineOverlay.inputEdgeIntensity" = "Wartość akcentacji gradientu Sobela podczas wyszukiwania krawędzi obrazu. Wyższa wartość powoduje znalezienie większej ilości krawędzi, lecz najczęściej wykorzystywana jest niższa wartość (np. 1,0)."; "CILineOverlay.inputThreshold" = "Ta wartość określa widoczność krawędzi. Jej zwiększenie przerzedza krawędzie."; "CILineOverlay.inputContrast" = "Poziom wygładzania krawędzi utworzonych przez filtr. Im wyższa wartość, tym większy kontrast krawędzi (mniejsze wygładzenie)."; "CIPixellate.inputCenter" = "Współrzędne x i y środka efektu";  "CIPixellate.inputScale" = "Skala określa wielkość kwadratów. Im większa wartość, tym większe kwadraty."; "CIPointillize.inputRadius" = "Promień okręgów we wzorze wynikowym."; "CIPointillize.inputCenter" = "Współrzędne x i y środka efektu";  "CIShadedMaterial.inputShadingImage" = "Obraz do wykorzystania jako pole wysokości. Obraz wynikowy ma większą wysokość w jaśniejszych miejscach i niższą w ciemniejszych."; "CIShadedMaterial.inputScale" = "Skala efektu. Im większa wartość, tym bardziej widoczny efekt."; "CISpotColor.inputCenterColor1" = "Centralna wartość pierwszego zakresu kolorów do zmiany."; "CISpotColor.inputReplacementColor1" = "Kolor zamienny dla pierwszego zakresu kolorów."; "CISpotColor.inputCloseness1" = "Wartość określająca stopień zgodności pierwszego koloru, powodujący jego zmianę."; "CISpotColor.inputContrast1" = "Kontrast pierwszego koloru zamiennego."; "CISpotColor.inputCenterColor2" = "Centralna wartość drugiego zakresu kolorów do zmiany."; "CISpotColor.inputReplacementColor2" = "Kolor zamienny dla drugiego zakresu kolorów.";"CISpotColor.inputCloseness2" = "Wartość określająca stopień zgodności drugiego koloru, powodujący jego zmianę."; "CISpotColor.inputContrast2" = "Kontrast drugiego koloru zamiennego."; "CISpotColor.inputCenterColor3" = "Centralna wartość trzeciego zakresu kolorów do zmiany.";  "CISpotColor.inputReplacementColor3" = "Kolor zamienny dla trzeciego zakresu kolorów."; "CISpotColor.inputCloseness3" = "Wartość określająca stopień zgodności trzeciego koloru, powodujący jego zmianę.";  "CISpotColor.inputContrast3" = "Kontrast trzeciego koloru zamiennego.";  "CISpotLight.inputLightPosition" = "Współrzędne x i y reflektora."; 		"CISpotLight.inputLightPointsAt" = "Współrzędne x i y miejsca, w które skierowany jest reflektor.";  "CISpotLight.inputBrightness" = "Jasność reflektora."; "CISpotLight.inputConcentration" = "Wielkość reflektora. Im mniejsza wartość, tym bardziej skupione światło."; "CISpotLight.inputColor" = "Kolor światła reflektora."; "CIAffineClamp.inputTransform" = "Transformacja do naniesienia na obraz."; "CIAffineTile.inputTransform" = "Transformacja do naniesienia na obraz."; "CIEightfoldReflectedTile.inputCenter" = "Współrzędne x i y środka efektu";  "CIEightfoldReflectedTile.inputAngle" = "Kąt mozaiki (w stopniach)."; "CIEightfoldReflectedTile.inputWidth" = "Szerokość płytki."; "CIFourfoldReflectedTile.inputCenter" = "Współrzędne x i y środka efektu";  "CIFourfoldReflectedTile.inputAngle" = "Kąt mozaiki (w stopniach).";  "CIFourfoldReflectedTile.inputAcuteAngle" = "Podstawowy kąt powtarzania odbitych płytek. Małe wartości tworzą cienkie płytki, większe wartości tworzą grubsze płytki."; "CIFourfoldReflectedTile.inputWidth" = "Szerokość płytki.";  "CIFourfoldRotatedTile.inputCenter" = "Współrzędne x i y środka efektu";  "CIFourfoldRotatedTile.inputAngle" = "Kąt mozaiki (w stopniach).";  "CIFourfoldRotatedTile.inputWidth" = "Szerokość płytki."; "CIFourfoldTranslatedTile.inputCenter" = "Współrzędne x i y środka efektu";  "CIFourfoldTranslatedTile.inputAngle" = "Kąt mozaiki (w stopniach).";  "CIFourfoldTranslatedTile.inputAcuteAngle" = "Podstawowy kąt powtarzania przetworzonych płytek. Małe wartości tworzą cienkie płytki, większe wartości tworzą grubsze płytki."; "CIFourfoldTranslatedTile.inputWidth" = "Szerokość płytki.";  "CIGlideReflectedTile.inputCenter" = "Współrzędne x i y środka efektu";  "CIGlideReflectedTile.inputAngle" = "Kąt mozaiki (w stopniach).";  "CIGlideReflectedTile.inputWidth" = "Szerokość płytki.";  "CIKaleidoscope.inputCount" = "Ilość odbić we wzorze."; "CIKaleidoscope.inputCenter" = "Współrzędne x i y środka efektu";  "CIKaleidoscope.inputAngle" = "Kąt odbicia."; "CIOpTile.inputCenter" = "Współrzędne x i y środka efektu";  "CIOpTile.inputScale" = "Skala określa ilość płytek dla efektu."; "CIOpTile.inputAngle" = "Kąt płytki."; "CIOpTile.inputWidth" = "Szerokość płytki."; "CIParallelogramTile.inputCenter" = "Współrzędne x i y środka efektu"; "CIParallelogramTile.inputAngle" = "Kąt mozaiki (w stopniach).";  "CIParallelogramTile.inputAcuteAngle" = "Podstawowy kąt równoległobocznych płytek. Małe wartości tworzą cienkie płytki, większe wartości tworzą grubsze płytki."; "CIParallelogramTile.inputWidth" = "Szerokość płytki.";  "CIPerspectiveTile.inputTopLeft" = "Współrzędne lewego górnego rogu płytki."; "CIPerspectiveTile.inputTopRight" = "Współrzędne prawego górnego rogu płytki.";"CIPerspectiveTile.inputBottomRight" = "Współrzędne prawego dolnego rogu płytki."; "CIPerspectiveTile.inputBottomLeft" = "Współrzędne lewego dolnego rogu płytki."; "CISixfoldReflectedTile.inputCenter" = "Współrzędne x i y środka efektu";  "CISixfoldReflectedTile.inputAngle" = "Kąt mozaiki (w stopniach).";  "CISixfoldReflectedTile.inputWidth" = "Szerokość płytki."; "CISixfoldRotatedTile.inputCenter" = "Współrzędne x i y środka efektu"; "CISixfoldRotatedTile.inputAngle" = "Kąt mozaiki (w stopniach).";  "CISixfoldRotatedTile.inputWidth" = "Szerokość płytki.";  "CITriangleTile.inputCenter" = "Współrzędne x i y środka efektu";  "CITriangleTile.inputAngle" = "Kąt mozaiki (w stopniach).";  "CITriangleTile.inputWidth" = "Szerokość płytki.";  "CITwelvefoldReflectedTile.inputCenter" = "Współrzędne x i y środka efektu"; "CITwelvefoldReflectedTile.inputAngle" = "Kąt mozaiki (w stopniach).";"CITwelvefoldReflectedTile.inputWidth" = "Szerokość płytki."; "CIBarsSwipeTransition.inputAngle" = "Kąt rolet (w stopniach).";	"CIBarsSwipeTransition.inputWidth" = "Szerokość każdej rolety.";	"CIBarsSwipeTransition.inputBarOffset" = "Przesunięcie jednej rolety względem drugiej";	"CIBarsSwipeTransition.inputTime" = "Parametryczny czas przejścia. Wartość ta prowadzi efekt przejścia od początku (czas równy 0) do końca (czyli 1).";"CICopyMachineTransition.inputColor" = "Kolor światła kopiarki.";"CICopyMachineTransition.inputAngle" = "Kąt światła kopiarki.";"CICopyMachineTransition.inputWidth" = "Szerokość światła kopiarki.";"CICopyMachineTransition.inputOpacity" = "Krycie światła kopiarki. Wartość 0,0 oznacza całkowitą przezroczystość. Wartość 1,0 to brak przezroczystości.";"CICopyMachineTransition.inputTime" = "Parametryczny czas przejścia. Wartość ta prowadzi efekt przejścia od początku (czas równy 0) do końca (czyli 1).";"CIDisintegrateWithMaskTransition.inputMaskImage" = "Obraz określający kształt używany przy przejściu z obrazu źródłowego do obrazu docelowego.";"CIDisintegrateWithMaskTransition.inputShadowRadius" = "Odległość cienia utworzonego przez maskę.";"CIDisintegrateWithMaskTransition.inputShadowDensity" = "Gęstość cienia utworzonego przez maskę.";"CIDisintegrateWithMaskTransition.inputShadowOffset" = "Przesunięcie cienia utworzonego przez maskę.";"CIDisintegrateWithMaskTransition.inputTime" = "Parametryczny czas przejścia. Wartość ta prowadzi efekt przejścia od początku (czas równy 0) do końca (czyli 1).";"CIDissolveTransition.inputTime" = "Parametryczny czas przejścia. Wartość ta prowadzi efekt przejścia od początku (czas równy 0) do końca (czyli 1).";"CIFlashTransition.inputCenter" = "Współrzędne x i y środka efektu"; "CIFlashTransition.inputExtent" = "Obszar rozbłysku.";"CIFlashTransition.inputColor" = "Kolor promieni światła rozbłysku.";"CIFlashTransition.inputMaxStriationRadius" = "Promień rozbłysku.";"CIFlashTransition.inputStriationStrength" = "Siła światła rozbłysku.";"CIFlashTransition.inputStriationContrast" = "Kontrast promieni światła rozbłysku.";"CIFlashTransition.inputFadeThreshold" = "Stopień wygaszania rozbłysku. Im wyższa wartość, tym więcej rozbłysku, a mniej wygaszenia.";"CIFlashTransition.inputTime" = "Parametryczny czas przejścia. Wartość ta prowadzi efekt przejścia od początku (czas równy 0) do końca (czyli 1).";"CIModTransition.inputCenter" = "Współrzędne x i y środka efektu"; "CIModTransition.inputAngle" = "Kąt wzoru otworów.";"CIModTransition.inputRadius" = "Promień nie zniekształconych otworów we wzorze.";"CIModTransition.inputCompression" = "Rozciągnięcie naniesione na wzór otworów. Otwory na środku są mniej zniekształcone niż te na brzegach obrazu.";"CIModTransition.inputTime" = "Parametryczny czas przejścia. Wartość ta prowadzi efekt przejścia od początku (czas równy 0) do końca (czyli 1).";"CIPageCurlTransition.inputBacksideImage" = "Obraz pojawiający się w tle obrazu źródłowego, podczas odwracania strony odsłaniającej obraz wynikowy.";"CIPageCurlTransition.inputShadingImage" = "Obraz wyglądający jak cieniowana kula zamknięta w kwadratowym obrazie.";"CIPageCurlTransition.inputExtent" = "Rozmiary efektu.";"CIPageCurlTransition.inputAngle" = "Kąt odwracanej strony.";"CIPageCurlTransition.inputRadius" = "Promień odwrócenia strony.";"CIPageCurlTransition.inputTime" = "Parametryczny czas przejścia. Wartość ta prowadzi efekt przejścia od początku (czas równy 0) do końca (czyli 1).";"CIRippleTransition.inputShadingImage" = "Obraz wyglądający jak cieniowana kula zamknięta w kwadratowym obrazie.";"CIRippleTransition.inputCenter" = "Współrzędne x i y środka efektu"; "CIRippleTransition.inputExent" = "Rozmiary efektu.";"CIRippleTransition.inputWidth" = "Szerokość fali.";"CIRippleTransition.inputScale" = "Wartość określająca, czy fala rozpoczyna się od wybrzuszenia (wyższa wartość) lub wgłębienia (niższa wartość).";"CIRippleTransition.inputTime" = "Parametryczny czas przejścia. Wartość ta prowadzi efekt przejścia od początku (czas równy 0) do końca (czyli 1).";"CISwipeTransition.inputExtent" = "Rozmiary efektu.";"CISwipeTransition.inputColor" = "Kolor odwrócenia.";"CISwipeTransition.inputAngle" = "Kąt odwrócenia.";"CISwipeTransition.inputWidth" = "Szerokość odwrócenia";"CISwipeTransition.inputOpacity" = "Krycie odwrócenia.";"CISwipeTransition.inputTime" = "Parametryczny czas przejścia. Wartość ta prowadzi efekt przejścia od początku (czas równy 0) do końca (czyli 1).";"CIAreaHistogram" = "Oblicza histogram dla określonego obszaru obrazu, zwracając wynik w postaci obrazu 1D.";"CIAreaHistogram.inputExtent" = "Prostokąt określający region obrazu, który chcesz przetwarzać.";"CIAreaHistogram.inputCount" = "Liczba komórek dla histogramu.";"CIAreaHistogram.inputImage" = "Obraz, którego histogram chcesz obliczyć.";"CIAreaHistogram.inputScale" = "Wartość skalowania używana dla wartości histogramu.";"CIAreaMaximum" = "Oblicza maksymalne wartości składników dla określonego obszaru na obrazie, zwracając wynik na 1 piksel.";"CIAreaMaximum.inputExtent" = "Prostokąt określający region obrazu, który chcesz przetwarzać.";"CIAreaMaximum.inputImage" = "Obraz, który chcesz przetwarzać.";"CIAreaMinimum" = "Oblicza minimalne wartości składników dla określonego obszaru na obrazie, zwracając wynik na 1 piksel.";"CIAreaMinimum.inputExtent" = "Prostokąt określający region obrazu, który chcesz przetwarzać.";"CIAreaMinimum.inputImage" = "Obraz, który chcesz przetwarzać.";"CIAreaMaximumAlpha" = "Znajduje i zwraca piksel z maksymalną wartością alfa.";"CIAreaMaximumAlpha.inputExtent" = "Prostokąt określający region obrazu, który chcesz przetwarzać.";"CIAreaMaximumAlpha.inputImage" = "Obraz, który chcesz przetwarzać.";"CIAreaMinimumAlpha" = "Znajduje i zwraca piksel z minimalną wartością alfa.";"CIAreaMinimumAlpha.inputExtent" = "Prostokąt określający region obrazu, który chcesz przetwarzać.";"CIAreaMinimumAlpha.inputImage" = "Obraz, który chcesz przetwarzać.";"CIAreaAverage" = "Oblicza średni kolor wskazanego obszaru obrazu, zwracając wynik na jeden piksel.";"CIAreaAverage.inputExtent" = "Prostokąt określający region obrazu, który chcesz przetwarzać.";"CIAreaAverage.inputImage" = "Obraz, który chcesz przetwarzać.";"CIRowAverage" = "Oblicza średni kolor dla każdego wiersza określonego obszaru, zwracając wynik w postaci obrazu 1D.";"CIRowAverage.inputExtent" = "Prostokąt określający region obrazu, który chcesz przetwarzać.";"CIRowAverage.inputImage" = "Obraz, który chcesz przetwarzać.";"CIColumnAverage" = "Oblicza średni kolor dla każdej kolumny określonego obszaru, zwracając wynik w postaci obrazu 1D.";"CIColumnAverage.inputExtent" = "Prostokąt określający region obrazu, który chcesz przetwarzać.";"CIColumnAverage.inputImage" = "Obraz, który chcesz przetwarzać.";"CIMinimumComponent" = "Przekształca obraz na obraz w skali szarości, wykorzystując minimalny z trzech składników koloru.";"CIMinimumComponent.inputExtent" = "Prostokąt określający region obrazu, który chcesz przetwarzać.";"CIMinimumComponent.inputImage" = "Obraz, który chcesz przetwarzać.";"CIMaximumComponent" = "Przekształca obraz na obraz w skali szarości, wykorzystując maksymalny z trzech składników koloru.";"CIMaximumComponent.inputExtent" = "Prostokąt określający region obrazu, który chcesz przetwarzać.";"CIMaximumComponent.inputImage" = "Obraz, który chcesz przetwarzać.";